


Mobility for IPv6 (MIP6)                                     J. Korhonen
Internet-Draft                                                U. Nilsson
Intended status: Experimental                                TeliaSonera
Expires: April 20, 2008                                   V. Devarapalli
                                                                  Azaire
                                                        October 18, 2007


                   Service Selection for Mobile IPv6
                   draft-korhonen-mip6-service-04.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on April 20, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2007).

Abstract

   In some Mobile IPv6 deployments identifying the mobile node or the
   mobility service subscriber is not enough to distinguish between
   multiple services possibly provisioned to the said mobile node and
   its mobility service subscription.  A capability to specify different
   services in addition to the mobile node identity can be leveraged to
   provide flexibility for mobility service providers on provisioning



Korhonen, et al.         Expires April 20, 2008                 [Page 1]

Internet-Draft         Service Selection for MIPv6          October 2007


   multiple services to one mobility service subscription.  This
   document describes a Service Selection Mobility Option for both
   conventional Mobile IPv6 and Proxy Mobile IPv6 that is intended to
   assist home agents to make a specific service selection for the
   mobility service subscription during the binding registration
   procedure.


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . . . 3
   2.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . . . 4
   3.  Service Selection Mobility Option . . . . . . . . . . . . . . . 4
   4.  Processing Considerations . . . . . . . . . . . . . . . . . . . 5
     4.1.  Mobile Node Considerations  . . . . . . . . . . . . . . . . 5
     4.2.  Home Agent Considerations . . . . . . . . . . . . . . . . . 5
     4.3.  Correspondent Node Considerations . . . . . . . . . . . . . 6
   5.  Security Considerations . . . . . . . . . . . . . . . . . . . . 6
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 7
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . . . 7
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . . . 7
     8.1.  Normative References  . . . . . . . . . . . . . . . . . . . 7
     8.2.  Informative References  . . . . . . . . . . . . . . . . . . 7
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . . . 8
   Intellectual Property and Copyright Statements  . . . . . . . . . . 9


























Korhonen, et al.         Expires April 20, 2008                 [Page 2]

Internet-Draft         Service Selection for MIPv6          October 2007


1.  Introduction

   Mobile IPv6 [1] can identify mobile nodes in various ways, including
   home addresses [1], Network Access Identifiers (NAIs) [4][5], and
   credentials suitable for IKEv2 [6].  In some Mobile IPv6 deployments
   identifying the mobile node or the mobility service subscriber via a
   Proxy Mobile IPv6 client [7] (hereafter the mobile node and the Proxy
   Mobile IPv6 client are used interchangeably) is not enough to
   distinguish between multiple services possibly provisioned to the
   said mobile node and its mobility service subscription.

   The capability to specify different services in addition to the
   mobile node identity can be leveraged to provide flexibility for
   mobility service providers to provide multiple services within the
   same mobility service subscription.  For example:

   o  Provide an enterprise data access for witch the mobility service
      provider hosts connectivity and mobility services on behalf of the
      enterprise.

   o  Provide access to service domains that are otherwise not
      accessible from public networks because of some mobility service
      provider's business reasons.

   o  Provide simultaneous access to different service domains that are
      separated based on policies of the mobility service provider.

   o  Enable easier policy and quality of service assignment for
      mobility service providers based on the subscribed services.

   o  In absence of a specifically indicated service the home agent MUST
      act as if the default service, plain Internet access had been
      requested.  There is no absolute requirement that this default
      service be allowed to all subscribers, but it is highly
      RECOMMENDED in order to avoid having normal subscribers employ
      operator-specific configuration values in order to get basic
      service.

   This document describes a Service Selection Mobility Option for
   Mobile IPv6 that is intended to assist home agents to make specific
   service selections for the mobility service subscription during the
   binding registration procedure.  The service selection may affect
   home agent routing decisions, Home Address or Home Network Prefix
   assignment policies, firewall settings, and security policies.  The
   Service Selection option should be used in every Binding Update that
   makes a new registration to the home agent.





Korhonen, et al.         Expires April 20, 2008                 [Page 3]

Internet-Draft         Service Selection for MIPv6          October 2007


2.  Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [2].


3.  Service Selection Mobility Option

   The Service Selection mobility option MAY be included in any Binding
   Update message.  It SHOULD be included at least in the Binding Update
   message that is sent for the initial binding registration when the
   mobile node and the home agent do not have an existing binding.  If
   the Binding Update message includes any authorization related options
   (such as the Binding Authorization Data option [1]) or authentication
   related options (such as the Mobility Message Authentication option
   [8]), then the Service Selection option MUST appear before any
   mobility message authorization or authentication related options.

   The service selection option SHOULD NOT be send to a correspondent
   node.  The mobile node cannot assume that the correspondent node has
   any knowledge about a specific service selection made between the
   mobile node and the home agent.

   The Service Selection option has no alignment requirement as such.


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |  Type = TBD   |   Length      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Identifier...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                     Service Selection Mobility Option

   o  Type: 8-bit identifier set to TBD (to be defined by IANA) of the
      type of the skipable mobility option.

   o  Length: 8-bit unsigned integer, representing the length of the
      Service Selection mobility option in octets, excluding the Option
      Type and Option Length fields.








Korhonen, et al.         Expires April 20, 2008                 [Page 4]

Internet-Draft         Service Selection for MIPv6          October 2007


   o  Identifier: A variable length UTF-8 [3] encoded service identifier
      string used to identify the requested service.

      'ims', 'voip' and 'voip.companyxyz.example.com' are valid examples
      of Service Selection option Identifiers.  At minimum the
      Identifier MUST be unique among the home agents the mobile node is
      authorized to register to.


4.  Processing Considerations

4.1.  Mobile Node Considerations

   A mobile node or a Proxy Mobile IPv6 client MAY include the Service
   Selection mobility option into a Binding Update message.  The option
   is used to identify the service to be associated with the binding
   registration and SHOULD only be included into the initial Binding
   Update message sent to a home agent.  If the mobile node wishes to
   change the selected service, it is RECOMMENDED that the node de-
   register the existing binding with the home agent before proceeding
   with a binding registration for a different service.  The
   provisioning of the service identifiers to the mobile node or to the
   Proxy Mobile IPv6 client is out of scope of this specification.

   The placement of the Service Selection option is as follows: when
   present this option MUST appear after the MN-NAI option, if the MN-
   NAI option is present, and before any authorization and
   authentication related options.  The Service Selection option can be
   used with any mobile node identification method such as a home
   address, a MN-NAI and credentials suitable for IKEv2.

   If the mobile node receives a Binding Acknowledgement with a Status
   Code set to SERVICE_AUTHORIZATION_FAILED and the mobile node has an
   existing binding with the Home Address or the Home Network Prefix
   used in the failed Binding Update message, the mobile node MUST
   delete the existing binding.  If there is no existing binding the
   mobile node proceeds as with any failed initial binding registration.

4.2.  Home Agent Considerations

   Upon receiving a Bind Update message with a Service Selection option
   the home agent authenticates and authorizes the mobile node.  If the
   home agent supports the Service Selection it MUST also verify that
   the mobile node is authorized for the service it included in the
   Service Selection option.  The services the mobile node is authorized
   for SHOULD be part of the general mobile node subscription profile.
   If the mobile node is not authorized for the service the home agent
   MUST deny the registration and send a Binding Acknowledgement with a



Korhonen, et al.         Expires April 20, 2008                 [Page 5]

Internet-Draft         Service Selection for MIPv6          October 2007


   Status Code set to SERVICE_AUTHORIZATION_FAILED (error code TBD).

   The Service Selection option is used to assist the authorization and
   identifies a specific service that is to be authorized.  The Service
   Selection option MAY also affect the Home Address or the Home Network
   Prefix allocation when for example used with the MN-NAI option.  For
   example, for the same NAI there MAY be different Home Addresses or
   Home Network Prefixes depending on the identified service.
   Furthermore, the Service Selection option MAY also affect the routing
   of the outbound IP packets in the home agent depending on the
   selected service.  The home agent MAY also apply different policy or
   quality of service treatment to traffic flows based on the selected
   service.

   If the newly arrived Binding Update message with a Service Selection
   option indicates a change in the selected service, then the home
   agent MUST re-authorize the mobile node.  Depending on the home agent
   policies, the services policies, Home Address or Home Network Prefix
   allocation policies and the subscription policies the home agent may
   or may not be able to authorize the mobile node to the new service.
   For example the existing service and the new service could require
   different Home Network Prefixes.  If the authorization fails then the
   home agent MUST deny the registration, delete any binding with the
   existing Home Address or Home Network Prefix and send a Binding
   Acknowledgement with a Status Code set to
   SERVICE_AUTHORIZATION_FAILED (error code TBD).

4.3.  Correspondent Node Considerations

   Unless the correspondent node and the home agent share the same
   knowledge about mobility services the Service Selection option is
   more or less useless information to the correspondent node.  The
   correspondent node SHOULD silently ignore the Service Selection
   option.


5.  Security Considerations

   The protection for the Service Selection mobility option depends on
   the service that is being identified and eventually selected.  If the
   service selection information should not be revealed on the wire,
   Binding Updates and Binding Acknowledgements should use Encapsulating
   Security Payload (ESP) [9] in transport mode with a non-null
   encryption transform to provide message confidentiality.







Korhonen, et al.         Expires April 20, 2008                 [Page 6]

Internet-Draft         Service Selection for MIPv6          October 2007


6.  IANA Considerations

   A new Mobile IPv6 Mobility Option type is required for the following
   new mobility option described in Section 3:

       Service Selection Mobility Option       is set to TBD

   A new Mobile IPv6 registration denied by home agent Status Code is
   required.  The Status Code must be allocated from the range 128-255:

       SERVICE_AUTHORIZATION_FAILED            is set to TBD


7.  Acknowledgements

   Jouni korhonen would like to thank TEKES MERCoNe project for
   providing funding to work on this document.  The authors would like
   to thank Jari Arkko for his thorough review.


8.  References

8.1.  Normative References

   [1]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support in
        IPv6", RFC 3775, June 2004.

   [2]  Bradner, S., "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [3]  Yergeau, F., "UTF-8, a transformation format of ISO 10646",
        STD 63, RFC 3629, November 2003.

8.2.  Informative References

   [4]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The Network
        Access Identifier", RFC 4282, December 2005.

   [5]  Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury,
        "Mobile Node Identifier Option for Mobile IPv6 (MIPv6)",
        RFC 4283, November 2005.

   [6]  Devarapalli, V. and F. Dupont, "Mobile IPv6 Operation with IKEv2
        and the Revised IPsec Architecture", RFC 4877, April 2007.

   [7]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and
        B. Patil, "Proxy Mobile IPv6", draft-ietf-netlmm-proxymip6-06
        (work in progress), September 2007.



Korhonen, et al.         Expires April 20, 2008                 [Page 7]

Internet-Draft         Service Selection for MIPv6          October 2007


   [8]  Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury,
        "Authentication Protocol for Mobile IPv6", RFC 4285,
        January 2006.

   [9]  Kent, S., "IP Encapsulating Security Payload (ESP)", RFC 4303,
        December 2005.


Authors' Addresses

   Jouni Korhonen
   TeliaSonera Corporation
   P.O.Box 970
   FIN-00051 Sonera
   Finland

   Email: jouni.korhonen@teliasonera.com


   Ulf Nilsson
   TeliaSonera Corporation
   Marbackagatan 11
   S-123 86 Farsta
   Sweden

   Email: ulf.s.nilsson@teliasonera.com


   Vijay Devarapalli
   Azaire Networks
   4800 Great America Pkwy
   Santa Clara, CA 95054
   USA

   Email: vijay.devarapalli@azairenet.com
















Korhonen, et al.         Expires April 20, 2008                 [Page 8]

Internet-Draft         Service Selection for MIPv6          October 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Korhonen, et al.         Expires April 20, 2008                 [Page 9]

